_posts/2023-06-21-The-Seamstress-Event-Loop-in-Zig.html
<p>
I've been working on <a href="https://github.com/ryleelyman/seamstress">a program called <b>seamstress</b></a> for the past couple of months.
I think it's in a pretty good spot, even if it's early days.
The program is heavily inspired by <a href="https://github.com/monome/norns">monome's norns</a>, specifically its <b>matron</b> program,
which embeds the <a href="https://www.lua.org">Lua</a> programming language to speak with monome's grid and arc controllers,
MIDI, OSC, a screen, the norns' keys and encoders, and so forth.
One big difference between seamstress and matron is, besides the fact that
seamstress is designed for desktops/laptops rather than a purpose-built device,
is that seamstress is written in <a href="https://ziglang.org">Zig</a>, a young C-like programming language.
The purpose of this post is to describe seamstress's event loop.
</p>

<p>
By the way, since Zig is likely to change,
I'm writing this in June 2023, with a development version of Zig version 0.11.0.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c244df">1. Roll your own linked list</a>
<ul>
<li><a href="#orgf5f5603">1.1. Nodes</a></li>
<li><a href="#orgd31ffe8">1.2. Queues</a></li>
<li><a href="#org42ea8fe">1.3. Failing to push to a queue</a></li>
<li><a href="#org6d4546b">1.4. Allocating memory in Zig</a></li>
</ul>
</li>
<li><a href="#org2aa498f">2. An event loop</a></li>
<li><a href="#orgfaa75d8">3. Seamstress's event loop</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2c244df" class="outline-2">
<h2 id="org2c244df"><span class="section-number-2">1.</span> Roll your own linked list</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf5f5603" class="outline-3">
<h3 id="orgf5f5603"><span class="section-number-3">1.1.</span> Nodes</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A <a href="https://en.wikipedia.org/wiki/Linked_list">linked list</a> is a standard data structure where elements of the list
know who comes before and after them and the list itself
knows who is at the start and the end.
It's easy enough to roll your own linked list, so let's do it.
Strictly speaking, one does not need to do this;
Zig's standard library has things like <code>std.TailQueue</code> which work great.
But it's not too hard (she says having spent an afternoon hashing out precisely how to do it),
and it feels good to know what goes into things like this.
So let's define a <b>node</b> in a linked list.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
  const Node = struct {
      next: ?*Node,
      prev: ?*Node,
      data: *Data,
  };
{% endhighlight %}
</pre>
</div>

<p>
Okay hi, hello, welcome to Zig. Let's talk through it.
So we're declaring a new <code>struct</code> type called <code>Node</code>.
Because we don't plan on altering the type itself,
we mark it <code>const</code> (as opposed to <code>var</code>).
This <code>struct</code> has three <i>fields,</i> <code>next</code>, <code>prev</code> and <code>data</code>.
The <code>data</code> field is a <i>pointer</i> to a struct with type <code>Data</code>.
We haven't yet defined <code>Data</code>, but that's okay.
Okay and pointers?
It's funny, I grew up reading my dad's C programming language books,
but many powerful programming languages don't have a concept of a pointer;
pointers are messy.
The idea is that the pointer is <b>not</b> the object itself,
but a little thing that says "hi, you can <b>find</b> what you're looking for at this memory address."
Zig has pointers.
</p>

<p>
The usefulness of pointers becomes clear when we consider the <code>next</code> and <code>prev</code> fields:
forgetting about the <code>?</code> for a moment, notice that they're of type <code>Node</code> themselves!
So we <b>have</b> to use a pointer here, otherwise a <code>Node</code> would have to contain a <code>Node</code>
which contains a <code>Node</code> etc. etc.
Okay anyway the <code>?</code> says that our <code>Node</code> entries are allowed to be <code>null</code>,
that is, <b>not</b> to point to something valid.
(Notice that this implies that the <code>data</code> entry must always be valid! That's amazing!)
</p>
</div>
</div>

<div id="outline-container-orgd31ffe8" class="outline-3">
<h3 id="orgd31ffe8"><span class="section-number-3">1.2.</span> Queues</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Cool, so far so good.
Let's put nodes into a queue&#x2026; literally:
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
const Queue = struct {
    const Node = struct {
        next: ?*Node,
        prev: ?*Node,
        data: *Data,
    };
    head: ?*Node,
    tail: ?*Node,
    size: usize,
};
{% endhighlight %}
</pre>
</div>

<p>
If you know a little C, we did something a bit surprising:
we put the definition of a <code>Node</code> <b>inside</b> the definition of <code>Queue</code>.
Zig lets you do this; it effectively "namespaces" <code>Node</code>, which is maybe neither here nor there,
so that's all I'll say about it.
</p>
</div>
</div>

<div id="outline-container-org42ea8fe" class="outline-3">
<h3 id="org42ea8fe"><span class="section-number-3">1.3.</span> Failing to push to a queue</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Okay so a queue has a head and a tail, which may be null, and a size,
which is a <code>usize</code> (an unsigned integer type appropriate for, well, sizes).
How should we interact with it? let's write some functions.
Zig lets us put them <b>inside</b> of <code>Queue</code> too, but I'll present them by themselves.
Okay warning, for, like, exposition purposes, I'm giving you <b>incorrect code</b> here.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
fn push(self: *Queue, data: Data) void {
    var new_node = Node{
        .next = null,
        .prev = null,
        .data = data,
    };
    if (self.tail) |n| {
        self.tail = &amp;new_node;
        n.next = &amp;new_node;
        new_node.prev = n;
    } else {
        std.debug.assert(self.size == 0);
        self.tail = &amp;new_node;
        self.head = &amp;new_node;
    }
    self.size += 1;
}
{% endhighlight %}
</pre>
</div>

<p>
In fact, while this looks beguilingly like correct code,
it won't compile, and not just because we haven't defined the <code>Data</code> type!
I'll get to that in a moment. First let's make sense of more Zig syntax.
</p>

<p>
We declare a function with the <code>fn</code> keyword.
This function is named <code>push</code> and it takes in two arguments:
<code>self</code>, which is a pointer to a <code>Queue</code>, and <code>data</code>, which is some <code>Data</code>.
The function returns <code>void</code>, i.e. it gives you nothing back.
We declare variables with the <code>var</code> keyword.
We're making <code>new_node</code> a struct object of type <code>Node</code>
and assigning to its fields by accessing them with the dot syntax.
(Shortly we'll meet another way to declare elements of struct type.)
The if statement has an interesting <code>|n|</code> bit after it.
The point is that <code>self.tail</code> is allowed to be <code>null</code>.
We say <code>if</code> it's <b>not</b> null, then give us what it is,
and capture that in a new (<code>const</code>) variable <code>n</code>.
Since <code>self.tail</code> expects to be a pointer to a node and not a node,
we assign to it the <b>address</b> or <b>reference</b> of <code>new_node</code> by using the <code>&amp;</code> operator, like in C.
So you should read the <code>if</code> statement as saying
"if <code>self.tail</code> is not null, we assign the reference of <code>new_node</code> to it,
we set the <code>next</code> field of the old tail, i.e. <code>n</code>, to <code>new_node</code> (or its address)
and set the <code>prev</code> field of the new node to <code>n</code>."
If not, the <code>else</code> statement says "well first of all, the size had better be zero or we're bailing,
and if so we set the head <b>and</b> tail of <code>self</code> to our new node."
Finally in either case we add one to the size of our queue.
</p>
</div>
