_org/2023-06-21-The-Seamstress-Event-Loop-in-Zig.org
*** Testing our failing code

So what goes wrong?
The immediate problem that the compiler will complain to you about
is that ~data~ the function argument and ~.data~ the field are of different types:
one is a ~Data~ and the other is a ~*Data~.
You can try and sneak around this in various ways,
but there's really a problem lurking in the background that the following test should reveal.

#+begin_src zig
  {% highlight zig %}
  test {
      var queue = Queue{
          .head = null,
          .tail = null,
          .size = 0,
      };
      var i: u8 = 0;
      while (i < 100) : (i += 1) {
          queue.push(i);
      }
      try std.testing.expect(queue.size == 100);
      i = 0;
      var node = queue.head;
      while (i < 100) : (i += 1) {
          try std.testing.expect(node.?.data.* == i);
          node = node.?.next;
      }
  }
  {% endhighlight %}
#+end_src

(To make this test work on your code you'll need to find some way to fix the compiler error above
and replace ~Data~ by the ~u8~ type.)
First of all, it's neat that Zig builds in a testing framework like this.
Anyway, I won't explain this test in detail,
beyond the line that will fail without bigger fixes:

~try std.testing.expect(node.?.data.* == i);~.

Don't worry about the ~try~; we'll meet it later.
The ~.?~ "unwraps" the possibility for ~node~ to be ~null~
and gives an error if it is null.
It's similar to the ~if~ we saw above, but, like, more compact and also
probably should only be used if we *should* fail if the result is ~null~.
The ~.*~ "dereferences" the pointer and gives us the value of what it points to,
rather than the pointer itself.
So we're essentially expecting that the ith element of our linked list
should have ~.data~ field ~i~, which is reasonable,
given that that's what we pushed previously!
But... it's not. This test fails.
I'd like to tell you my hypothesis about why.

*** The stack vs. the heap

One way to imagine how a program executes is the "call stack".
A program pushes function calls and so forth onto the stack
and the CPU pops things off of the stack and executes them.
Declaring variables can work like this too;
the CPU assigns some memory to the variable
and it lives until it goes out of "scope".
For example, in our test, the variable ~i~ lives during the whole ~test~ block.
If we declared a ~const~ or ~var~ *inside* of the ~while~ loop,
it would be born anew each iteration and die each time we reach the closing brace.
And this is really the problem:
when we call ~queue.push(i)~ (which is, to my knowledge, equivalent to calling
~Queue.push(&queue, i)~)
the variable ~new_node~ *dies* at the end of the function call.
Its memory is no longer guaranteed to represent what we want it to.

So we need a way of creating ~Node~ objects that live longer than the scope of ~push~.
This means that we have to ask the computer for memory that we're going to hold onto!
Memory like this is often referred to as "heap allocated" (as opposed to "stack allocated").
Memory from the heap continues to belong to the program until it exits,
so it's the responsibility of the program to let go of it when its no longer needed,
otherwise we say a program "leaks" memory.

** Allocating memory in Zig

In C, it's very easy to leak memory; just call ~malloc~ (short for *memory* *allocation*,
but I like to imagine a little devil, "mal" meaning bad, named ~malloc~) without
later calling ~free~.
In Zig, it's still possible to leak memory, but the language will try to help you out.
First of all, we need to *choose* an allocator, which is of type ~std.mem.Allocator~.
Zig gives you several choices;
maybe the best one for most purposes is the "general purpose allocator".
Let's grab it.

#+begin_src zig
  {% highlight zig %}
  var allocator: std.mem.Allocator = undefined;

  pub fn main() void {
      var general_allocator = std.heap.GeneralPurposeAllocator(.{}) {};
      allocator = general_allocator.allocator();
      defer _ = general_allocator.deinit();
  }
  {% endhighlight %}
#+end_src

It's possible that this is an anti-pattern:
I've declared my allocator as if it were a ~static~ variable in C.
It's not initialized until we enter ~main~, where we grab it in two stages.
In seamstress, I then tend to pass the allocator to other source files in their init functions.

Anyway, so much for the allocator.
We'll often call ~allocator.alloc()~ to make many copies of something
(the Zig word is "slices"), or ~allocator.create()~
to create single objects.

