_posts/2023-06-21-The-Seamstress-Event-Loop-in-Zig.html

<div id="outline-container-org0534988" class="outline-4">
<h4 id="org0534988"><span class="section-number-4">1.3.1.</span> Testing our failing code</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
So what goes wrong?
The immediate problem that the compiler will complain to you about
is that <code>data</code> the function argument and <code>.data</code> the field are of different types:
one is a <code>Data</code> and the other is a <code>*Data</code>.
You can try and sneak around this in various ways,
but there's really a problem lurking in the background that the following test should reveal.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
test {
    var queue = Queue{
        .head = null,
        .tail = null,
        .size = 0,
    };
    var i: u8 = 0;
    while (i &lt; 100) : (i += 1) {
        queue.push(i);
    }
    try std.testing.expect(queue.size == 100);
    i = 0;
    var node = queue.head;
    while (i &lt; 100) : (i += 1) {
        try std.testing.expect(node.?.data.* == i);
        node = node.?.next;
    }
}
{% endhighlight %}
</pre>
</div>

<p>
(To make this test work on your code you'll need to find some way to fix the compiler error above
and replace <code>Data</code> by the <code>u8</code> type.)
First of all, it's neat that Zig builds in a testing framework like this.
Anyway, I won't explain this test in detail,
beyond the line that will fail without bigger fixes:
</p>

<p>
<code>try std.testing.expect(node.?.data.* == i);</code>.
</p>

<p>
Don't worry about the <code>try</code>; we'll meet it later.
The <code>.?</code> "unwraps" the possibility for <code>node</code> to be <code>null</code>
and gives an error if it is null.
It's similar to the <code>if</code> we saw above, but, like, more compact and also
probably should only be used if we <b>should</b> fail if the result is <code>null</code>.
The <code>.*</code> "dereferences" the pointer and gives us the value of what it points to,
rather than the pointer itself.
So we're essentially expecting that the ith element of our linked list
should have <code>.data</code> field <code>i</code>, which is reasonable,
given that that's what we pushed previously!
But&#x2026; it's not. This test fails.
I'd like to tell you my hypothesis about why.
</p>
</div>
</div>

<div id="outline-container-org4c7ddd7" class="outline-4">
<h4 id="org4c7ddd7"><span class="section-number-4">1.3.2.</span> The stack vs. the heap</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
One way to imagine how a program executes is the "call stack".
A program pushes function calls and so forth onto the stack
and the CPU pops things off of the stack and executes them.
Declaring variables can work like this too;
the CPU assigns some memory to the variable
and it lives until it goes out of "scope".
For example, in our test, the variable <code>i</code> lives during the whole <code>test</code> block.
If we declared a <code>const</code> or <code>var</code> <b>inside</b> of the <code>while</code> loop,
it would be born anew each iteration and die each time we reach the closing brace.
And this is really the problem:
when we call <code>queue.push(i)</code> (which is, to my knowledge, equivalent to calling
<code>Queue.push(&amp;queue, i)</code>)
the variable <code>new_node</code> <b>dies</b> at the end of the function call.
Its memory is no longer guaranteed to represent what we want it to.
</p>

<p>
So we need a way of creating <code>Node</code> objects that live longer than the scope of <code>push</code>.
This means that we have to ask the computer for memory that we're going to hold onto!
Memory like this is often referred to as "heap allocated" (as opposed to "stack allocated").
Memory from the heap continues to belong to the program until it exits,
so it's the responsibility of the program to let go of it when its no longer needed,
otherwise we say a program "leaks" memory.
</p>
</div>
</div>
</div>

<div id="outline-container-org6d4546b" class="outline-3">
<h3 id="org6d4546b"><span class="section-number-3">1.4.</span> Allocating memory in Zig</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In C, it's very easy to leak memory; just call <code>malloc</code> (short for <b>memory</b> <b>allocation</b>,
but I like to imagine a little devil, "mal" meaning bad, named <code>malloc</code>) without
later calling <code>free</code>.
In Zig, it's still possible to leak memory, but the language will try to help you out.
First of all, we need to <b>choose</b> an allocator, which is of type <code>std.mem.Allocator</code>.
Zig gives you several choices;
maybe the best one for most purposes is the "general purpose allocator".
Let's grab it.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
var allocator: std.mem.Allocator = undefined;

pub fn main() void {
    var general_allocator = std.heap.GeneralPurposeAllocator(.{}) {};
    allocator = general_allocator.allocator();
    defer _ = general_allocator.deinit();
}
{% endhighlight %}
</pre>
</div>

<p>
It's possible that this is an anti-pattern:
I've declared my allocator as if it were a <code>static</code> variable in C.
It's not initialized until we enter <code>main</code>, where we grab it in two stages.
In seamstress, I then tend to pass the allocator to other source files in their init functions.
</p>

<p>
Anyway, so much for the allocator.
We'll often call <code>allocator.alloc()</code> to make many copies of something
(the Zig word is "slices"), or <code>allocator.create()</code>
to create single objects.
</p>
</div>
