_org/2023-06-21-The-Seamstress-Event-Loop-in-Zig.org
*** Correctly pushing to a queue

Let's correct our ~push~ function so that it allocates a Node from the heap instead.

#+begin_src zig
  {% highlight zig %}
  fn push(self: *Queue, data: *u8) !void {
      var new_node = try allocator.create(Queue.Node);
      new_node.next = null;
      new_node.prev = null;
      new_node.data = data;
      if (self.tail) |n| {
          self.tail = new_node;
          n.next = new_node;
          new_node.prev = n;
      } else {
          std.debug.assert(self.size == 0);
          self.tail = new_node;
          self.head = new_node;
      }
      self.size += 1;
  }

  test {
      allocator = std.testing.allocator;
      var queue = .{
          .head = null,
          .tail = null,
          .size = 0,
      };
      var i: u8 = 0;
      while (i < 100) : (i += 1) {
          var j = try allocator.create(u8);
          j.* = i;
          try queue.push(j);
      }
      try std.testing.expect(queue.size == 100);
      i = 0;
      var node = queue.head;
      while (i < 100) : (i += 1) {
          try std.testing.expect(node.?.data.* == i);
          node = node.?.next;
      }
  }
  {% endhighlight %}
#+end_src

Now technically this test passes,
(provided you replace references to ~Data~ types with ~u8~)
but it yells at us for leaking memory right and left,
and rightly so: we have 100 little ~u8~ variables and 100 bigger ~Node~ variables
just sort of hanging out on the heap when we end the program.

Notice as well that we had to make a change to our functions call-signature:
by adding the ~!~ we're acknowledging that our function *may* return an ~error~ type:
that's also why we have ~try~ in front of ~allocator.create~:
memory allocation may fail!
That's a fact of life, and Zig rightly forces you to acknowledge it.
The ~try~ statement says "attempt to do the following function;
if we get an error back, just chuck it further up the chain."
Instead of ~try~ we could write ~catch~ and handle the error in the function itself.
I'd rather seamstress just fail if it can't allocate memory,
so I don't do this.

So let's correct the leak by providing a ~pop~ function.
I'll return to acting as though we've defined a ~Data~ type that maybe comes with
~new~ and ~deinit~ methods.

#+begin_src zig
  {% highlight zig %}
  fn pop(self: *Queue) ?*Data {
      if (self.head) |n| {
          const data = n.data;
          self.head = n.next;
          allocator.destroy(n);
          if (self.size == 1) self.tail = null;
          self.size -= 1;
          return data;
      } else {
          std.debug.assert(self.size == 0);
          return null;
      }
  }

  test {
      var queue = .{
          .head = null,
          .tail = null,
          .size = 0,
      };
      allocator = std.testing.allocator;
      var i: u8 = 0;
      while (i < 100) : (i += 1) {
          var datum = Data.new(i);
          try queue.push(datum);
      }
      i = 0;
      while (i < 100) : (i += 1) {
          const datum = queue.pop();
          std.testing.expect(datum != null);
          std.testing.expect(datum.?.i == i);
          datum.deinit();
      }
  }
  {% endhighlight %}
#+end_src

Obviously this "test" is missing some scaffolding to make it actually work,
but hopefully it gets across the idea.
The ~pop()~ function removes from the head of the queue provided the queue has size at least one.
Once it's done, it calls ~destroy()~ on the node that we got,
so we don't leak memory from zombie ~Node~ objects.

* An event loop

Seamstress, like many programs that interface with devices from the outside world,
spends a lot of its time waiting for something to happen.
The main loop might at firsst look something like this:

#+begin_src zig
  {% highlight zig %}
  pub fn loop() !void {
      while (!quit) {
          if (queue.size == 0) continue;
          const data = queue.pop();
          if (data) |d| try handle(d);
      }
  }
  {% endhighlight %}
#+end_src

There are two things wrong with this.
The first is that seamstress will run at 100% CPU with this model
even when there are no events in the queue;
it's burning those cycles repeatedly checking the size of the queue.
The other thing is that in order for this event handling model to make sense,
we need something to deliver events to us.
If we're stuck in the event loop,
the only way for something else to happen is if it happens *in another thread.*
Multi-threading is very fun, but it also creates the possibility for bad behavior:
what should happen, for example,
if multiple threads try to push to the queue at the same time?
Or what if I try to pull the only event from the queue while someone else tries to push to it,
who controls how the ~size~ parameter ends up?

Zig's standard library helps us solve both of those problems:
we'll go back to our ~Queue~ struct and add two new fields.
I'll also take this time to put our ~push~ and ~pop~ methods inside the ~Queue~ struct.

#+begin_src zig
  {% highlight zig %}
  var quit = false;
  var allocator: std.mem.Allocator = undefined;
  var queue: Queue = undefined;

  const Queue = struct {
      const Node = {
          next: ?*Node,
          prev: ?*Node,
          data: *Data,
      };
      head: ?*Node,
      tail: ?*Node,
      size: usize,
      lock: std.Thread.Mutex,
      cond: std.Thread.Condition,
      fn push(self: *Queue, data: *Data) void {
          var new_node = allocator.create(Node);
          new_node.prev = null;
          new_node.next = null;
          new_node.data = data;
          if (self.tail) |n| {
              self.tail = new_node;
              n.next = new_node;
              new_node.prev = n;
          } else {
              std.debug.assert(self.size == 0);
              self.tail = new_node;
              self.head = new_node;
          }
          self.size += 1;
      }
      fn pop(self: *Queue) ?*Data {
          if (self.head) |n| {
              const data = n.data;
              self.head = n.next;
              allocator.destroy(n);
              if (self.size == 1) self.tail = null;
              self.size -= 1;
              return data;
          } else {
              std.debug.assert(self.size == 0);
              return null;
          }
      }
  }

  pub fn post(data: *Data) !void {
      queue.lock.lock();
      try queue.push(event);
      queue.cond.signal();
      queue.lock.unlock();
  }

  pub fn loop() !void {    
      while (!quit) {
          queue.lock.lock();
          while (queue.size == 0) {
              if (quit) break;
              queue.cond.wait(&queue.lock);
          }
          const data = queue.pop();
          queue.lock.unlock();
          if (data) |d| try handle(d);
      }
  }
  {% endhighlight %}
#+end_src

This code is better for threading and better for our CPU.
Now while the queue has size zero,
we ~wait()~, releasing the lock and sleeping until some other thread
calls ~signal()~ on our ~cond~.
Code in other files doesn't call ~push()~ or ~pop()~ directly,
but instead should add to the queue with ~post()~ and our main thread
will handle events in ~loop()~.

