_posts/2023-06-21-The-Seamstress-Event-Loop-in-Zig.html

<div id="outline-container-org9ce69d7" class="outline-4">
<h4 id="org9ce69d7"><span class="section-number-4">1.4.1.</span> Correctly pushing to a queue</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Let's correct our <code>push</code> function so that it allocates a Node from the heap instead.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
fn push(self: *Queue, data: *u8) !void {
    var new_node = try allocator.create(Queue.Node);
    new_node.next = null;
    new_node.prev = null;
    new_node.data = data;
    if (self.tail) |n| {
        self.tail = new_node;
        n.next = new_node;
        new_node.prev = n;
    } else {
        std.debug.assert(self.size == 0);
        self.tail = new_node;
        self.head = new_node;
    }
    self.size += 1;
}

test {
    allocator = std.testing.allocator;
    var queue = .{
        .head = null,
        .tail = null,
        .size = 0,
    };
    var i: u8 = 0;
    while (i &lt; 100) : (i += 1) {
        var j = try allocator.create(u8);
        j.* = i;
        try queue.push(j);
    }
    try std.testing.expect(queue.size == 100);
    i = 0;
    var node = queue.head;
    while (i &lt; 100) : (i += 1) {
        try std.testing.expect(node.?.data.* == i);
        node = node.?.next;
    }
}
{% endhighlight %}
</pre>
</div>

<p>
Now technically this test passes,
(provided you replace references to <code>Data</code> types with <code>u8</code>)
but it yells at us for leaking memory right and left,
and rightly so: we have 100 little <code>u8</code> variables and 100 bigger <code>Node</code> variables
just sort of hanging out on the heap when we end the program.
</p>

<p>
Notice as well that we had to make a change to our functions call-signature:
by adding the <code>!</code> we're acknowledging that our function <b>may</b> return an <code>error</code> type:
that's also why we have <code>try</code> in front of <code>allocator.create</code>:
memory allocation may fail!
That's a fact of life, and Zig rightly forces you to acknowledge it.
The <code>try</code> statement says "attempt to do the following function;
if we get an error back, just chuck it further up the chain."
Instead of <code>try</code> we could write <code>catch</code> and handle the error in the function itself.
I'd rather seamstress just fail if it can't allocate memory,
so I don't do this.
</p>

<p>
So let's correct the leak by providing a <code>pop</code> function.
I'll return to acting as though we've defined a <code>Data</code> type that maybe comes with
<code>new</code> and <code>deinit</code> methods.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
fn pop(self: *Queue) ?*Data {
    if (self.head) |n| {
        const data = n.data;
        self.head = n.next;
        allocator.destroy(n);
        if (self.size == 1) self.tail = null;
        self.size -= 1;
        return data;
    } else {
        std.debug.assert(self.size == 0);
        return null;
    }
}

test {
    var queue = .{
        .head = null,
        .tail = null,
        .size = 0,
    };
    allocator = std.testing.allocator;
    var i: u8 = 0;
    while (i &lt; 100) : (i += 1) {
        var datum = Data.new(i);
        try queue.push(datum);
    }
    i = 0;
    while (i &lt; 100) : (i += 1) {
        const datum = queue.pop();
        std.testing.expect(datum != null);
        std.testing.expect(datum.?.i == i);
        datum.deinit();
    }
}
{% endhighlight %}
</pre>
</div>

<p>
Obviously this "test" is missing some scaffolding to make it actually work,
but hopefully it gets across the idea.
The <code>pop()</code> function removes from the head of the queue provided the queue has size at least one.
Once it's done, it calls <code>destroy()</code> on the node that we got,
so we don't leak memory from zombie <code>Node</code> objects.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org2aa498f" class="outline-2">
<h2 id="org2aa498f"><span class="section-number-2">2.</span> An event loop</h2>
<div class="outline-text-2" id="text-2">
<p>
Seamstress, like many programs that interface with devices from the outside world,
spends a lot of its time waiting for something to happen.
The main loop might at firsst look something like this:
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
pub fn loop() !void {
    while (!quit) {
        if (queue.size == 0) continue;
        const data = queue.pop();
        if (data) |d| try handle(d);
    }
}
{% endhighlight %}
</pre>
</div>

<p>
There are two things wrong with this.
The first is that seamstress will run at 100% CPU with this model
even when there are no events in the queue;
it's burning those cycles repeatedly checking the size of the queue.
The other thing is that in order for this event handling model to make sense,
we need something to deliver events to us.
If we're stuck in the event loop,
the only way for something else to happen is if it happens <b>in another thread.</b>
Multi-threading is very fun, but it also creates the possibility for bad behavior:
what should happen, for example,
if multiple threads try to push to the queue at the same time?
Or what if I try to pull the only event from the queue while someone else tries to push to it,
who controls how the <code>size</code> parameter ends up?
</p>

<p>
Zig's standard library helps us solve both of those problems:
we'll go back to our <code>Queue</code> struct and add two new fields.
I'll also take this time to put our <code>push</code> and <code>pop</code> methods inside the <code>Queue</code> struct.
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
var quit = false;
var allocator: std.mem.Allocator = undefined;
var queue: Queue = undefined;

const Queue = struct {
    const Node = {
        next: ?*Node,
        prev: ?*Node,
        data: *Data,
    };
    head: ?*Node,
    tail: ?*Node,
    size: usize,
    lock: std.Thread.Mutex,
    cond: std.Thread.Condition,
    fn push(self: *Queue, data: *Data) void {
        var new_node = allocator.create(Node);
        new_node.prev = null;
        new_node.next = null;
        new_node.data = data;
        if (self.tail) |n| {
            self.tail = new_node;
            n.next = new_node;
            new_node.prev = n;
        } else {
            std.debug.assert(self.size == 0);
            self.tail = new_node;
            self.head = new_node;
        }
        self.size += 1;
    }
    fn pop(self: *Queue) ?*Data {
        if (self.head) |n| {
            const data = n.data;
            self.head = n.next;
            allocator.destroy(n);
            if (self.size == 1) self.tail = null;
            self.size -= 1;
            return data;
        } else {
            std.debug.assert(self.size == 0);
            return null;
        }
    }
}

pub fn post(data: *Data) !void {
    queue.lock.lock();
    try queue.push(event);
    queue.cond.signal();
    queue.lock.unlock();
}

pub fn loop() !void {    
    while (!quit) {
        queue.lock.lock();
        while (queue.size == 0) {
            if (quit) break;
            queue.cond.wait(&amp;queue.lock);
        }
        const data = queue.pop();
        queue.lock.unlock();
        if (data) |d| try handle(d);
    }
}
{% endhighlight %}
</pre>
</div>

<p>
This code is better for threading and better for our CPU.
Now while the queue has size zero,
we <code>wait()</code>, releasing the lock and sleeping until some other thread
calls <code>signal()</code> on our <code>cond</code>.
Code in other files doesn't call <code>push()</code> or <code>pop()</code> directly,
but instead should add to the queue with <code>post()</code> and our main thread
will handle events in <code>loop()</code>.
</p>
</div>
</div>
