_posts/2023-06-21-The-Seamstress-Event-Loop-in-Zig.html

<div id="outline-container-orgfaa75d8" class="outline-2">
<h2 id="orgfaa75d8"><span class="section-number-2">3.</span> Seamstress's event loop</h2>
<div class="outline-text-2" id="text-3">
<p>
The above works fine,
but it kind of bothered me that <code>push()</code>, and hence <code>post()</code>,
required a <code>try</code>, and it reminded me that allocating memory can be slow.
Moreover, if the event loop falls behind to such an extent
that the queue is bigger than some reasonably small number,
it's likely that the program is doing something pretty bad;
we should try to avoid this.
</p>

<p>
The solution I hit upon was to <b>preallocate</b> a pool of 1000 <code>Node</code> and <code>Data</code> objects
and keep them recirculating while the program runs.
This also has a nice added side-effect:
rather than having to define a <code>new()</code> method for creating pointers to <code>Data</code> objects,
<code>post()</code> can simply accept a <b>statically-allocated</b> <code>Data</code> object,
which the program then sets the <b>value</b> of the <code>Data</code> pointer to.
The <code>post()</code> and <code>loop()</code> functions as above work just the same,
although we can remove the <code>!</code> and <code>try</code> from <code>post()</code> as it no longer errors
since there's no memory allocation happening.
The code around the <code>Queue</code> struct now looks like this:
</p>

<div class="org-src-container">
<pre class="src src-zig">{% highlight zig %}
const Queue = struct {
    const Node = struct{
        next: ?*Node,
        prev: ?*Node,
        data: *Data,
    };
    read_head: ?*Node,
    read_tail: ?*Node,
    read_size: usize,
    write_head: ?*Node,
    write_tail: ?*Node,
    write_size: usize,
    lock: std.Thread.Mutex,
    cond: std.Thread.Condition,
    inline fn get_new(self: *Queue) *Node {
        var node = self.write_head orelse {
            @setCold(true);
            std.debug.assert(self.write_size == 0);
            std.debug.print("no nodes free!\n", .{});
            unreachable;
        };
        self.write_head = node.next;
        node.next = null;
        node.prev = null;
        self.write_size -= 1;
        return node;
    }
    inline fn return_to_pool(self: *Queue, node: *Node) void {
        if (self.write_tail) |n| {
            self.write_tail = node;
            n.next = node;
            node.prev = n;
        } else {
            @setCold(true);
            std.debug.assert(self.write_size == 0);
            self.write_head = node;
            self.write_tail = node;
        }
        self.write_size += 1;
    }
    fn push(self: *Queue, data: Data) void {
        var new_node = self.get_new();
        new_node.data.* = data;
        if (self.read_tail) |n| {
            self.read_tail = new_node;
            n.next = new_node;
            new_node.prev = n;
        } else {
            std.debug.assert(self.read_size == 0);
            self.read_tail = new_node;
            self.read_head = new_node;
        }
        self.read_size += 1;
    }
    fn pop(self: *Queue) ?*Data {
        if (self.read_head) |n| {
            const data = n.data;
            self.read_head = n.next;
            self.return_to_pool(n);
            if (self.read_size == 1) self.read_tail = null;
            self.read_size -= 1;
            return data;
        } else {
            std.debug.assert(self.read_size == 0);
            return null;
        }
    }
    fn deinit(self: *Queue) void {
        // assumes the read queue is empty
        var node = self.write_head;
        while (node) |n| {
            node = n.next;
            allocator.destroy(n.data);
            allocator.destroy(n);
        }
    }
}

pub fn init(alloc_ptr: std.mem.Allocator) !void {
    allocator = alloc_ptr;
    queue = .{
        .read_head = null,
        .read_tail = null,
        .read_size = 0,
        .write_tail = null,
        .write_head = null,
        .write_size = 0,
        .cond = .{},
        .lock = .{},
    };
    var i: u16 = 0;
    while (i &lt; 1000) : (i += 1) {
        var node = try allocator.create(Queue.Node);
        var data = try allocator.create(Data);
        data.* = undefined;
        node.* = .{ ev = data, .next = null, .prev = null };
        queue.return_to_pool(node);
    }
}
{% endhighlight %}
</pre>
</div>

<p>
Let me explain two pieces: <code>@setCold</code> is, as I understand it,
essentially an instruction to the optimizer that the block of code containing it
should be called very rarely.
Indeed, if we're <b>out</b> of <code>Node</code> objects, I want the program to fail,
hence why I put the keyword <code>unreachable</code> there.
Similarly, adding the <b>first</b> node to the pool of available nodes should happen only once
in a correctly functioning run of seamstress,
so optimizing so that branch is often ignored feels right.
</p>

<p>
I'm very happy with how this structure is working for me in seamstress at the moment.
You can check for yourself the full contents of <code>events.zig</code> at <a href="https://github.com/ryleelyman/seamstress">GitHub</a>.
</p>
</div>
</div>
